misc/tips_and_tricks.org
#+TITLE: Tips & Tricks
#+DESCRIPTION: Tips & tricks and web links
#+OPTIONS: ^:{}

* Emacs
** Using tramp connection with a different port
#+BEGIN_SRC emacs-lisp
  C-x C-f /ssh:test@host#2222:/tmp
#+END_SRC
* Network
** Port forward
At home, the association between =xgarrido.dyndns.org= address with the local IP
must be done by adding

#+BEGIN_SRC sh
192.168.1.77 xgarrido.dyndns.org
#+END_SRC

in =/etc/hosts= file.

* Plotting with python/matplotlib

#+tblname: delsee
| airmass | zenith_seeing | delivered_seeing |
|---------+---------------+------------------|
|     1.3 |          0.95 |        1.1119612 |
|     1.3 |           1.0 |        1.1704854 |
|     1.3 |           1.1 |        1.2875340 |
|     1.3 |           1.2 |        1.4045825 |
#+TBLFM: $3=$2*($1**0.6)

#+BEGIN_SRC python :var fname="delseepy.png" :var delsee=delsee :results file
  import matplotlib.pyplot as plt

  x, y, z = zip(*delsee)

  fig = plt.figure()
  axes = fig.add_subplot(1,1,1)
  axes.plot(y, z, marker='o')
  fig.savefig(fname)

  return fname
#+END_SRC
