doc/misc/tips_and_tricks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tips &amp; Tricks</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="description" content="Tips &amp; tricks and web links"
 />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
<a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Tips &amp; Tricks</h1><hr/>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Emacs</a>
<ul>
<li><a href="#sec-1-1">1.1. Using tramp connection with a different port</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Network</a>
<ul>
<li><a href="#sec-2-1">2.1. Port forward</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Plotting with python/matplotlib</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Using tramp connection with a different port</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">C-x C-f /ssh:test@host#2222:/tmp
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Network</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Port forward</h3>
<div class="outline-text-3" id="text-2-1">
<p>
At home, the association between <code>xgarrido.dyndns.org</code> address with the local IP
must be done by adding
</p>

<div class="org-src-container">

<pre class="src src-sh">192.168.1.77 xgarrido.dyndns.org
</pre>
</div>

<p>
in <code>/etc/hosts</code> file.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Plotting with python/matplotlib</h2>
<div class="outline-text-2" id="text-3">
<table id="delsee" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">airmass</th>
<th scope="col" class="right">zenith<sub>seeing</sub></th>
<th scope="col" class="right">delivered<sub>seeing</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1.3</td>
<td class="right">0.95</td>
<td class="right">1.1119612</td>
</tr>

<tr>
<td class="right">1.3</td>
<td class="right">1.0</td>
<td class="right">1.1704854</td>
</tr>

<tr>
<td class="right">1.3</td>
<td class="right">1.1</td>
<td class="right">1.2875340</td>
</tr>

<tr>
<td class="right">1.3</td>
<td class="right">1.2</td>
<td class="right">1.4045825</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt

<span class="org-variable-name">x</span>, <span class="org-variable-name">y</span>, <span class="org-variable-name">z</span> = <span class="org-builtin">zip</span>(*delsee)

<span class="org-variable-name">fig</span> = plt.figure()
<span class="org-variable-name">axes</span> = fig.add_subplot(1,1,1)
axes.plot(y, z, marker=<span class="org-string">'o'</span>)
fig.savefig(fname)

<span class="org-keyword">return</span> fname
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
